change-backend/app/controllers/goals_controller.rb

SELECT "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        @goal = Goal.find params[:id]

INSERT INTO "goals" ("original_goal", "original_s", "original_sm", "original_sma", "original_smar", "start_date", "end_date", "final_goal", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @goals = Goal.create!(
            original_goal: params[:original_goal],
            original_s: params[:original_s],
            original_sm: params[:original_sm],
            original_sma: params[:original_sma],
            original_smar: params[:original_smar],
            start_date: params[:start_date],
            end_date: params[:end_date],
            final_goal: params[:final_goal]
        )

SELECT "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "goals" SET "original_goal" = ?, "updated_at" = ? WHERE "goals"."id" = ?  [["original_goal", "test woohoo woohoo"], ["updated_at", "2021-05-25 18:42:18.950789"], ["id", 8]]
---
    def update
        @goal = Goal.find params[:id]
        @goal.update(
            original_goal: params[:original_goal],
            original_s: params[:original_s],
            original_sm: params[:original_sm],
            original_sma: params[:original_sma],
            original_smar: params[:original_smar],
            start_date: params[:start_date],
            end_date: params[:end_date],
            final_goal: params[:final_goal]
        )

SELECT "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "goals" WHERE "goals"."id" = ?  [["id", 8]]
---
    def destroy
        @goal = Goal.find params[:id]
        @goal.destroy